void BluetoothInit()        //蓝牙中断初始化（定时器1）
{
        TMOD= 0x21;        //定时器模式寄存器 T1工作模式为2，自动重装
        TH1 = 0xfd;        //设置波特率为9600
        TL1 = 0xfd;
	
        TH0= 0xff;         
        TL0=0x8c;          //0.125ms产生一次中断
	
        ET0=1;               
        TR0=1;             //打开定时器0
        TR1= 1;            //打开定时器1
	
        REN= 1;            //允许串口接收
        SM0= 0;            
        SM1= 1;            //串行口方式1波特率可变模式
        ES= 1;             //串口中断允许位
        EA=1;              //中断控制总允许
}